article/relational-database-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-22 Sat 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>关系型数据库设计</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">关系型数据库设计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga90bf29">1. 好的数据库设计原则</a>
<ul>
<li><a href="#orgb6fa6ff">1.1. 原则 1 没有冗余</a></li>
<li><a href="#org1327782">1.2. 原则 2 没有 “坏的” 依赖</a></li>
</ul>
</li>
<li><a href="#org0bd5968">2. 1NF</a></li>
<li><a href="#org037a1c5">3. 2NF</a></li>
<li><a href="#org2dc621f">4. 3NF</a></li>
<li><a href="#org4ecf004">5. BCNF, 4NF, 5NF</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga90bf29" class="outline-2">
<h2 id="orga90bf29"><span class="section-number-2">1</span> 好的数据库设计原则</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb6fa6ff" class="outline-3">
<h3 id="orgb6fa6ff"><span class="section-number-3">1.1</span> 原则 1 没有冗余</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>除了外键以外，数据库中的每个域 (field) 仅仅存在一张表 (table) 中</li>
<li>外键 (primary key) 的重复是允许的，因为数据库表之间需要通过外键来连接</li>
</ul>
</div>
</div>
<div id="outline-container-org1327782" class="outline-3">
<h3 id="org1327782"><span class="section-number-3">1.2</span> 原则 2 没有 “坏的” 依赖</h3>
<div class="outline-text-3" id="text-1-2">
<p>
在数据库的所有表中，所有数据仅仅取决于主键，不能有： <b><b>部分依赖</b></b> (partial
dependencies) 或 <b><b>传递依赖</b></b> (transitive dependencies)。
</p>

<p>
数据库在设计时根据其 “坏的” 依赖程度不同被分成了不同的正规化 (normalization)，
并根据不同正规化总结了 6 中范式 (normal forms)。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">简记</th>
<th scope="col" class="org-left">全称</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1NF</td>
<td class="org-left">First Normal Form</td>
</tr>

<tr>
<td class="org-left">2NF</td>
<td class="org-left">Second Normal Form</td>
</tr>

<tr>
<td class="org-left">3NF</td>
<td class="org-left">Third Normal Form</td>
</tr>

<tr>
<td class="org-left">BCNF</td>
<td class="org-left">Boyce-Codd Normal Form</td>
</tr>

<tr>
<td class="org-left">4NF</td>
<td class="org-left">Fourth Normal Form</td>
</tr>

<tr>
<td class="org-left">5NF</td>
<td class="org-left">Fifth Normal Form</td>
</tr>
</tbody>
</table>

<p>
范式在上表由上自下是包含关系，即符合 2NF 的数据库必然符合 1NF 。
</p>
</div>
</div>
</div>

<div id="outline-container-org0bd5968" class="outline-2">
<h2 id="org0bd5968"><span class="section-number-2">2</span> 1NF</h2>
<div class="outline-text-2" id="text-2">
<p>
1NF 要求数据库每个表的每一列都是 <b><b>原子的</b></b> ，即表中的每一列不能拆分成更细的数
据项。
</p>

<p>
<code>clients</code> 表记录了顾客和兽医以及宠物的数据，例如：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><code>client_id</code></th>
<th scope="col" class="org-left"><code>client_name</code></th>
<th scope="col" class="org-right"><code>vet_id</code></th>
<th scope="col" class="org-left"><code>vet_name</code></th>
<th scope="col" class="org-left"><code>pet_id</code></th>
<th scope="col" class="org-left"><code>pet_name</code></th>
<th scope="col" class="org-left"><code>pet_type</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2122</td>
<td class="org-left">Jack</td>
<td class="org-right">21</td>
<td class="org-left">PetVet</td>
<td class="org-left">1, 2, 3</td>
<td class="org-left">Sam, Hoober, Tom</td>
<td class="org-left">Bird, Dog, Hamster</td>
</tr>

<tr>
<td class="org-right">2428</td>
<td class="org-left">James</td>
<td class="org-right">21</td>
<td class="org-left">PetVet</td>
<td class="org-left">1</td>
<td class="org-left">Tim</td>
<td class="org-left">Dog</td>
</tr>

<tr>
<td class="org-right">2317</td>
<td class="org-left">Vernon</td>
<td class="org-right">45</td>
<td class="org-left">PetCare</td>
<td class="org-left">2</td>
<td class="org-left">Charlie</td>
<td class="org-left">Cat</td>
</tr>

<tr>
<td class="org-right">8324</td>
<td class="org-left">Helen</td>
<td class="org-right">95</td>
<td class="org-left">PetXY</td>
<td class="org-left">1, 2</td>
<td class="org-left">Kirby, Beefer</td>
<td class="org-left">Dog, Cat</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">+-- clients -------------+
|                        |
| client_id: primary key |
| client_name            |
| vet_id                 |
| vet_name               |
| +-- pets --------+     |
| |                |     |
| | pet_id         |     |
| | pet_name       |     |
| | pet_type       |     |
| +----------------+     |
+------------------------+
</pre>
</div>

<p>
在表中的有的顾客可能给一个兽医不止一个宠物，这会导致数据不原子的。为了消除这样
的问题，可以添加外键引用，结果如下：
</p>

<div class="org-src-container">
<pre class="src src-text">     +-- clients -------------+
  1  |                        |
+---&gt;+ client_id: primary key |
|    | client_name            |
|    | vet_id                 |
|    | vet_name               |
|    +------------------------+
|
|    +-- pets ----------------+
|    |                        |
|    | pet_id                 |
|    | pet_name               |
|    | pet_type               |
+----+ client_id: foreign key |
  *  +------------------------+
</pre>
</div>
</div>
</div>

<div id="outline-container-org037a1c5" class="outline-2">
<h2 id="org037a1c5"><span class="section-number-2">3</span> 2NF</h2>
<div class="outline-text-2" id="text-3">
<p>
部分依赖关系是指某个属性只由构成主键的部分列决定，而和另一些列无关。例如对课程表
</p>
<div class="org-src-container">
<pre class="src src-text">+-- courses -------------------------+
|                                    |
| course_id                          |
| student_no                         |
| student_name                       |
| score                              |
| primary key(course_id, student_no) |
+------------------------------------+
</pre>
</div>

<p>
此表的主键是（学号，课程号），而“姓名”列只由“学号”决定，与“课程号”无关，这就是
部分依赖关系。2NF 在满足 1NF 时还要求不包含部分依赖。
</p>
</div>
</div>

<div id="outline-container-org2dc621f" class="outline-2">
<h2 id="org2dc621f"><span class="section-number-2">4</span> 3NF</h2>
<div class="outline-text-2" id="text-4">
<p>
传递依赖是当一个非码的属性 A 依赖于另一个非码属性 B，但 B 并不能用作表的主键。
</p>

<div class="org-src-container">
<pre class="src src-text">+-- clients -------------+
|                        |
| client_id: primary key |
| client_name            |
| vet_id                 |
| vet_name               |
+------------------------+
</pre>
</div>

<p>
在上面的 <code>clients</code> 表中 <code>vet_name</code> 依赖于 <code>vet_id</code> ， <code>vet_id</code> 又依赖于
<code>client_id</code> ，所以 <code>vet_name</code> 传递依赖于 <code>client_id</code> 。
</p>

<div class="org-src-container">
<pre class="src src-text">     +-- clients -------------+             +-- vets ----------------+
  1  |                        |          1  |                        |
+---&gt;+ client_id: primary key |      +-----&gt;| vet_id: primary key    |
|    | client_name            |      |      | vet_name               |
|    | vet_id: foreign key    +------+      +------------------------+
|    +------------------------+  *
|
|    +-- pets ----------------+
|    |                        |
|    | pet_id                 |
|    | pet_name               |
|    | pet_type               |
+----+ client_id: foreign key |
  *  +------------------------+
</pre>
</div>

<p>
通过上述的表拆分，将 <code>clients</code> 添加 <code>vet_id</code> 外键来消除传递依赖。
</p>
</div>
</div>

<div id="outline-container-org4ecf004" class="outline-2">
<h2 id="org4ecf004"><span class="section-number-2">5</span> BCNF, 4NF, 5NF</h2>
<div class="outline-text-2" id="text-5">
<p>
通常创建数据库是满足 3NF 就可以了，BCNF, 4NF, 5NF 比较复杂，暂时先挂起吧！
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-02-22 Sat 19:24. Created by Jinghui Hu at 2019-06-28 Fri 11:04.</p>
</div>
</body>
</html>
